Дошкольное_учреждение83/src/Catalogs/удуУчетныеЕдиницы/удуУчетныеЕдиницы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>удуУчетныеЕдиницы</name>
  <basedOn>Catalog.удуМноготомники</basedOn>
  <basedOn>Catalog.удуСерии</basedOn>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>АвторПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидМатериала</name>
    <type>
      <types>CatalogRef.удуВидыМетодическихМатериалов</types>
    </type>
  </attributes>
  <attributes>
    <name>Год</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Издание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Иллюстрации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КлючевыеСлова</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоСтраниц</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МестоИздания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Многотомник</name>
    <type>
      <types>CatalogRef.удуМноготомники</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельностиДОУ</name>
    <type>
      <types>CatalogRef.удуНаправленияДеятельностиДОУ</types>
    </type>
  </attributes>
  <attributes>
    <name>НедоступенКВыдаче</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПерИздания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерТома</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбщееОбозначениеМатериала</name>
    <type>
      <types>EnumRef.удуОбозначенияМетодическихМатериалов</types>
    </type>
  </attributes>
  <attributes>
    <name>Представление</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РедактироватьПредставление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СведенияОтносящиесяКЗаглавию</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Серия</name>
    <type>
      <types>CatalogRef.удуСерии</types>
    </type>
  </attributes>
  <attributes>
    <name>Учредитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>EnumRef.СтавкиНДС</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Авторы</name>
    <attributes>
      <name>Автор</name>
      <type>
        <types>CatalogRef.удуАвторы</types>
      </type>
    </attributes>
    <attributes>
      <name>Роль</name>
      <type>
        <types>CatalogRef.удуРолиАвтора</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Образы</name>
    <attributes>
      <name>Образ</name>
      <type>
        <types>CatalogRef.Файлы</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Тип</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИндексКартинки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Издательства</name>
    <attributes>
      <name>Издательство</name>
      <type>
        <types>CatalogRef.удуИздательства</types>
      </type>
    </attributes>
    <attributes>
      <name>СтандартныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МестоИздания</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидСтандартногоНомера</name>
      <type>
        <types>EnumRef.удуВидыСтандартныхНомеров</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Дошкольное_учреждение83/src/Catalogs/удуУчетныеЕдиницы/Forms/ФормаВыбора/Module.bsl
&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборСписка(Список, ПараметрыОтбора)
	
	ЭлементыОтбора = Список.Отбор.Элементы;
	
	// наименование
	Если Не ЗначениеЗаполнено(ПараметрыОтбора["Наименование"]) Тогда
		ОбщегоНазначенияКлиентСервер.УдалитьОтборУСписка(Список.Отбор,
			Новый ПолеКомпоновкиДанных("Наименование"));
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьОтборУСпискаНаСодержит(
			Список.Отбор,
			Новый ПолеКомпоновкиДанных("Наименование"),
			ПараметрыОтбора["Наименование"]);
	КонецЕсли;
		
	// автор
	Если Не ЗначениеЗаполнено(ПараметрыОтбора["Автор"]) Тогда
		ОбщегоНазначенияКлиентСервер.УдалитьОтборУСписка(Список.Отбор,
			Новый ПолеКомпоновкиДанных("АвторПредставление"));
	Иначе
		Если Тип("СправочникСсылка.удуАвторы") = ТипЗнч(ПараметрыОтбора["Автор"]) Тогда
			ОтборПоАвтору = ПараметрыОтбора["Автор"].ПолучитьОбъект().Наименование;
		Иначе 
			ОтборПоАвтору = ПараметрыОтбора["Автор"];
		КонецЕсли;
		
		ОбщегоНазначенияКлиентСервер.УстановитьОтборУСпискаНаСодержит(
			Список.Отбор,
			Новый ПолеКомпоновкиДанных("АвторПредставление"),
			ОтборПоАвтору);
	КонецЕсли;	
	
	// направление
	Если Не ЗначениеЗаполнено(ПараметрыОтбора["Направление"]) Тогда
		ОбщегоНазначенияКлиентСервер.УдалитьОтборУСписка(Список.Отбор,
			Новый ПолеКомпоновкиДанных("НаправлениеДеятельностиДОУ"));
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьОтборУСпискаНаРавенство(
			Список.Отбор,
			Новый ПолеКомпоновкиДанных("НаправлениеДеятельностиДОУ"),
			ПараметрыОтбора["Направление"]);
		КонецЕсли;
		
	// вид материала
	Если Не ЗначениеЗаполнено(ПараметрыОтбора["ВидМатериала"]) Тогда
		ОбщегоНазначенияКлиентСервер.УдалитьОтборУСписка(Список.Отбор,
			Новый ПолеКомпоновкиДанных("ВидМатериала"));
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьОтборУСпискаНаРавенство(
			Список.Отбор,
			Новый ПолеКомпоновкиДанных("ВидМатериала"),
			ПараметрыОтбора["ВидМатериала"]);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура УстановитьОтбор()
	
	ПараметрыОтбора = Новый Соответствие();
	Параметрыотбора.Вставить("Наименование",ОтборНаименование);
	ПараметрыОтбора.Вставить("Автор", 	ОтборАвтор);
	ПараметрыОтбора.Вставить("Направление",	ОтборНаправление);
	ПараметрыОтбора.Вставить("ВидМатериала", Параметры.ВидМатериала);
	УстановитьОтборСписка(Список, ПараметрыОтбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборНаименованиеПриИзменении(Элемент)
	УстановитьОтбор();
КонецПроцедуры

&НаКлиенте
Процедура ОтборАвторПриИзменении(Элемент)
	УстановитьОтбор();
КонецПроцедуры

&НаКлиенте
Процедура ОтборНаправлениеПриИзменении(Элемент)
	УстановитьОтбор();
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Параметры.ВидМатериала) Тогда
		УстановитьОтбор();
	КонецЕсли;
	
КонецПроцедуры
